{
    "class_name": "Model",
    "config": {
        "name": "vgg16",
        "layers": [
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(720)",
                    "weight": "(720, 256, 3, 3)",
                    "layer_id": "139774172443144"
                },
                "name": "bbox_head.retina_cls",
                "inbound_nodes": [
                    [
                        [
                            "139774172592896/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139774172592896/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "bbox_head.cls_convs.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "139774172442920"
                },
                "name": "bbox_head.cls_convs.3",
                "inbound_nodes": [
                    [
                        [
                            "139774172594128/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139774172594128/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "bbox_head.cls_convs.2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "139774172442696"
                },
                "name": "bbox_head.cls_convs.2",
                "inbound_nodes": [
                    [
                        [
                            "139774172593736/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139774172593736/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "bbox_head.cls_convs.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "139774187601704"
                },
                "name": "bbox_head.cls_convs.1",
                "inbound_nodes": [
                    [
                        [
                            "139774187245752/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139774187245752/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "bbox_head.cls_convs.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "139774187601480"
                },
                "name": "bbox_head.cls_convs.0",
                "inbound_nodes": [
                    [
                        [
                            "neck.fpn_convs.0.conv"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "139774187599800"
                },
                "name": "neck.fpn_convs.0.conv",
                "inbound_nodes": [
                    [
                        [
                            "139774187246368/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139774187246368/Add0",
                "inbound_nodes": [
                    [
                        [
                            "neck.lateral_convs.0.conv"
                        ],
                        [
                            "139774187246704/UpsampleNearest2D"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 32, 1, 1)",
                    "layer_id": "139774187599688"
                },
                "name": "neck.lateral_convs.0.conv",
                "inbound_nodes": [
                    [
                        [
                            "139774187246816/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139774187246816/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.7"
                        ],
                        [
                            "139774187247152/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(32)",
                    "weight": "(32)",
                    "layer_id": "139774187766056"
                },
                "name": "backbone.blocks.3.layers.2.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(32, 192, 1, 1)",
                    "layer_id": "139774187766000"
                },
                "name": "backbone.blocks.3.layers.2.op.6",
                "inbound_nodes": [
                    [
                        [
                            "139774187247488/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187247488/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(192)",
                    "weight": "(192)",
                    "layer_id": "139774187765888"
                },
                "name": "backbone.blocks.3.layers.2.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(192, 1, 3, 3)",
                    "layer_id": "139774187765832"
                },
                "name": "backbone.blocks.3.layers.2.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187247992/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187247992/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(192)",
                    "weight": "(192)",
                    "layer_id": "139774188167064"
                },
                "name": "backbone.blocks.3.layers.2.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(192, 32, 1, 1)",
                    "layer_id": "139774188167008"
                },
                "name": "backbone.blocks.3.layers.2.op.0",
                "inbound_nodes": [
                    [
                        [
                            "139774187247152/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139774187247152/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.7"
                        ],
                        [
                            "backbone.blocks.3.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(32)",
                    "weight": "(32)",
                    "layer_id": "139774188166392"
                },
                "name": "backbone.blocks.3.layers.1.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(32, 192, 1, 1)",
                    "layer_id": "139774188166336"
                },
                "name": "backbone.blocks.3.layers.1.op.6",
                "inbound_nodes": [
                    [
                        [
                            "139774187249056/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187249056/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(192)",
                    "weight": "(192)",
                    "layer_id": "139774188166224"
                },
                "name": "backbone.blocks.3.layers.1.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(192, 1, 3, 3)",
                    "layer_id": "139774188166168"
                },
                "name": "backbone.blocks.3.layers.1.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187249560/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187249560/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(192)",
                    "weight": "(192)",
                    "layer_id": "139774188166056"
                },
                "name": "backbone.blocks.3.layers.1.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(192, 32, 1, 1)",
                    "layer_id": "139774188166000"
                },
                "name": "backbone.blocks.3.layers.1.op.0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(32)",
                    "weight": "(32)",
                    "layer_id": "139774188165384"
                },
                "name": "backbone.blocks.3.layers.0.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(32, 144, 1, 1)",
                    "layer_id": "139774188165328"
                },
                "name": "backbone.blocks.3.layers.0.op.6",
                "inbound_nodes": [
                    [
                        [
                            "139774187266848/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187266848/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(144)",
                    "weight": "(144)",
                    "layer_id": "139774188165216"
                },
                "name": "backbone.blocks.3.layers.0.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(144, 1, 7, 7)",
                    "layer_id": "139774188165160"
                },
                "name": "backbone.blocks.3.layers.0.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187267352/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187267352/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(144)",
                    "weight": "(144)",
                    "layer_id": "139774188165048"
                },
                "name": "backbone.blocks.3.layers.0.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(144, 24, 1, 1)",
                    "layer_id": "139774188164992"
                },
                "name": "backbone.blocks.3.layers.0.op.0",
                "inbound_nodes": [
                    [
                        [
                            "139774187267912/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139774187267912/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.7"
                        ],
                        [
                            "backbone.blocks.2.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(24)",
                    "weight": "(24)",
                    "layer_id": "139774188163872"
                },
                "name": "backbone.blocks.2.layers.1.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(24, 72, 1, 1)",
                    "layer_id": "139774188163816"
                },
                "name": "backbone.blocks.2.layers.1.op.6",
                "inbound_nodes": [
                    [
                        [
                            "139774187268528/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187268528/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(72)",
                    "weight": "(72)",
                    "layer_id": "139774188163704"
                },
                "name": "backbone.blocks.2.layers.1.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(72, 1, 3, 3)",
                    "layer_id": "139774188163648"
                },
                "name": "backbone.blocks.2.layers.1.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187269088/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187269088/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(72)",
                    "weight": "(72)",
                    "layer_id": "139774188163536"
                },
                "name": "backbone.blocks.2.layers.1.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(72, 24, 1, 1)",
                    "layer_id": "139774188163480"
                },
                "name": "backbone.blocks.2.layers.1.op.0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(24)",
                    "weight": "(24)",
                    "layer_id": "139774188015400"
                },
                "name": "backbone.blocks.2.layers.0.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(24, 96, 1, 1)",
                    "layer_id": "139774188299152"
                },
                "name": "backbone.blocks.2.layers.0.op.6",
                "inbound_nodes": [
                    [
                        [
                            "139774187269984/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187269984/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(96)",
                    "weight": "(96)",
                    "layer_id": "139774193418368"
                },
                "name": "backbone.blocks.2.layers.0.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(96, 1, 5, 5)",
                    "layer_id": "139774193418480"
                },
                "name": "backbone.blocks.2.layers.0.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187282896/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187282896/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(96)",
                    "weight": "(96)",
                    "layer_id": "139774207164088"
                },
                "name": "backbone.blocks.2.layers.0.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(96, 16, 1, 1)",
                    "layer_id": "139774207161400"
                },
                "name": "backbone.blocks.2.layers.0.op.0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.1.layers.0.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(16)",
                    "weight": "(16)",
                    "layer_id": "139774207125880"
                },
                "name": "backbone.blocks.1.layers.0.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.1.layers.0.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(16, 32, 1, 1)",
                    "layer_id": "139774207187992"
                },
                "name": "backbone.blocks.1.layers.0.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187283848/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187283848/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.1.layers.0.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(32)",
                    "weight": "(32)",
                    "layer_id": "139774207184968"
                },
                "name": "backbone.blocks.1.layers.0.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.1.layers.0.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(32, 1, 3, 3)",
                    "layer_id": "139774207188272"
                },
                "name": "backbone.blocks.1.layers.0.op.0",
                "inbound_nodes": [
                    [
                        [
                            "139774187284408/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187284408/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.0.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(32)",
                    "weight": "(32)",
                    "layer_id": "139774587627112"
                },
                "name": "backbone.blocks.0.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.0.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(32, 3, 3, 3)",
                    "layer_id": "139774193232808"
                },
                "name": "backbone.blocks.0.0",
                "inbound_nodes": []
            },
            {
                "class_name": "UpsampleNearest2D",
                "config": "None",
                "name": "139774187246704/UpsampleNearest2D",
                "inbound_nodes": [
                    [
                        [
                            "139774187246984/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139774187246984/Add0",
                "inbound_nodes": [
                    [
                        [
                            "neck.lateral_convs.1.conv"
                        ],
                        [
                            "139774187249280/UpsampleNearest2D"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 96, 1, 1)",
                    "layer_id": "139774187600024"
                },
                "name": "neck.lateral_convs.1.conv",
                "inbound_nodes": [
                    [
                        [
                            "139774187266232/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139774187266232/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.7"
                        ],
                        [
                            "backbone.blocks.5.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(96)",
                    "weight": "(96)",
                    "layer_id": "139774187883600"
                },
                "name": "backbone.blocks.5.layers.1.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(96, 288, 1, 1)",
                    "layer_id": "139774187883544"
                },
                "name": "backbone.blocks.5.layers.1.op.6",
                "inbound_nodes": [
                    [
                        [
                            "139774187285248/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187285248/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(288)",
                    "weight": "(288)",
                    "layer_id": "139774187883432"
                },
                "name": "backbone.blocks.5.layers.1.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(288, 1, 5, 5)",
                    "layer_id": "139774187883376"
                },
                "name": "backbone.blocks.5.layers.1.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187285752/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187285752/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(288)",
                    "weight": "(288)",
                    "layer_id": "139774187883264"
                },
                "name": "backbone.blocks.5.layers.1.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(288, 96, 1, 1)",
                    "layer_id": "139774187883208"
                },
                "name": "backbone.blocks.5.layers.1.op.0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(96)",
                    "weight": "(96)",
                    "layer_id": "139774187882592"
                },
                "name": "backbone.blocks.5.layers.0.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(96, 384, 1, 1)",
                    "layer_id": "139774187882536"
                },
                "name": "backbone.blocks.5.layers.0.op.6",
                "inbound_nodes": [
                    [
                        [
                            "139774187348096/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187348096/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "139774187882424"
                },
                "name": "backbone.blocks.5.layers.0.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(384, 1, 5, 5)",
                    "layer_id": "139774187882368"
                },
                "name": "backbone.blocks.5.layers.0.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187348600/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187348600/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "139774187882256"
                },
                "name": "backbone.blocks.5.layers.0.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(384, 64, 1, 1)",
                    "layer_id": "139774187882200"
                },
                "name": "backbone.blocks.5.layers.0.op.0",
                "inbound_nodes": [
                    [
                        [
                            "139774187349104/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139774187349104/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.7"
                        ],
                        [
                            "139774187349384/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "139774187881192"
                },
                "name": "backbone.blocks.4.layers.3.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 384, 1, 1)",
                    "layer_id": "139774187881136"
                },
                "name": "backbone.blocks.4.layers.3.op.6",
                "inbound_nodes": [
                    [
                        [
                            "139774187349720/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187349720/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "139774187881024"
                },
                "name": "backbone.blocks.4.layers.3.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(384, 1, 3, 3)",
                    "layer_id": "139774187880968"
                },
                "name": "backbone.blocks.4.layers.3.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187350224/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187350224/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "139774187880856"
                },
                "name": "backbone.blocks.4.layers.3.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(384, 64, 1, 1)",
                    "layer_id": "139774187880800"
                },
                "name": "backbone.blocks.4.layers.3.op.0",
                "inbound_nodes": [
                    [
                        [
                            "139774187349384/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139774187349384/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.7"
                        ],
                        [
                            "139774187350952/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "139774187769528"
                },
                "name": "backbone.blocks.4.layers.2.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 384, 1, 1)",
                    "layer_id": "139774187769472"
                },
                "name": "backbone.blocks.4.layers.2.op.6",
                "inbound_nodes": [
                    [
                        [
                            "139774187351288/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187351288/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "139774187769360"
                },
                "name": "backbone.blocks.4.layers.2.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(384, 1, 5, 5)",
                    "layer_id": "139774187769304"
                },
                "name": "backbone.blocks.4.layers.2.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187351792/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187351792/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "139774187769192"
                },
                "name": "backbone.blocks.4.layers.2.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(384, 64, 1, 1)",
                    "layer_id": "139774187769136"
                },
                "name": "backbone.blocks.4.layers.2.op.0",
                "inbound_nodes": [
                    [
                        [
                            "139774187350952/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139774187350952/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.1.op.7"
                        ],
                        [
                            "backbone.blocks.4.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "139774187768520"
                },
                "name": "backbone.blocks.4.layers.1.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.1.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 384, 1, 1)",
                    "layer_id": "139774187768464"
                },
                "name": "backbone.blocks.4.layers.1.op.6",
                "inbound_nodes": [
                    [
                        [
                            "139774187377496/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "139774187377496/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.1.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "139774187768352"
                },
                "name": "backbone.blocks.4.layers.1.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.1.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(384, 1, 7, 7)",
                    "layer_id": "139774187768296"
                },
                "name": "backbone.blocks.4.layers.1.op.3",
                "inbound_nodes": [
                    [
                        [
                            "139774187378000/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
